{"articles":[{"id":333301,"title":"Win prizes, LIVE!","headerThumb":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/333301\/thumb\/imagethumb_1601285139.png","shortSummary":"Join our LIVE giveaway on October 2nd at 5PM ET","headerImage":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/333301\/header\/imageheader_1601285139.png","body":"Are you enjoying everything Oktoberfest has to offer? After an exciting week with many cool events across our games, we're topping it off with a special giveaway. So special, in fact, we're not just giving away prizes like a TABLET, but we're doing it LIVE!<br><br>The show takes place on Friday, October 2nd at 5PM ET (22:00 UK). All you have to do for a chance to win a prize, is just be online (any game, any room!) and watch the show. Will you be there?","publicationDate":1601298000,"likes":{"amount":1836,"hasLiked":true}},{"id":332601,"title":"Happy Hours!","headerThumb":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/332601\/thumb\/imagethumb_1601064098.png","shortSummary":"Join us and celebrate Oktoberfest in GamePoint Bingo!","headerImage":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/332601\/header\/imageheader_1601064098.png","body":"To celebrate Oktoberfest we're hosting daily Happy Hours! That means loads of fun activities for you to enjoy! Join us every day at 1AM, 7AM, 1PM and 7PM ET for special mini events in GamePoint Bingo!<br><br>What can you expect? The Golden Ball, Extra SuperBingos, get-the-last-card-free, an hourly gift and so much more! Make sure you don't miss out on all the fun!","publicationDate":1601107200,"likes":{"amount":1827,"hasLiked":false}},{"id":331201,"title":"Bingo Road!","headerThumb":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/331201\/thumb\/imagethumb_1600869373.jpg","shortSummary":"Go on an Oktoberfest adventure and progress toward amazing rewards!","headerImage":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/331201\/header\/imageheader_1600869373.jpg","body":"With Autumn settling in slowly and temperatures dropping, we thought it would be a good idea to start a new Bingo Road. And as you may have noticed: It's Oktoberfest! Join us on our Oktoberfest themed Bingo Road and start collecting Pretzels to progress toward amazing rewards.<br><br>Like always, there are many ways to earn EXTRA Pretzels, like playing in a higher stake Bingo room, joining a SuperBingo, or collecting your free coins when the timer expires. There's even a chance that a Pretzel will float through your game; just pop it to collect it!","publicationDate":1601033400,"callToAction":{"buttonType":"green","buttonText":"Learn more","buttonAction":{"openEvent":"candyRoad"}},"likes":{"amount":1777,"hasLiked":true}},{"id":196601,"title":"Free Bingo Cards","headerThumb":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/196601\/thumb\/imagethumb_1586436367.png","shortSummary":"Learn everything about Free Bingo Cards and how to use them.","headerImage":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/196601\/header\/imageheader_1586436367.png","body":"If you like playing GamePoint Bingo, you'll probably LOVE Free Bingo Cards. We'll good news, because we love giving away free Bingo Cards as much as you love receiving them! It's possible that you'll receive free Bingo cards as a gift when you sign in, or you might win them during a quiz or giveaway.<br><br>We've received lots of questions on how to use free Bingo Cards, which is why we thought it be helpful to provide you with a little bit more information. If you received free Bingo Cards, you can recognize them by their color. Your free cards are green instead of yellow. The green cards mean that they won't cost you any additional Coins when you click to play. However, if your cards are yellow, it means that they will cost you additional Coins to play.<br><br>You can find all your Bingo Cards in the grey navigation bar right next to the Collections icon. Here, your cards (both purchased and received) are organized by room value. This is a great way to find out how many Bingo Cards you still have left to play with.<br><br>Another important thing worth mentioning is that your Bingo Cards can’t be exchanged for Coins. Once you’ve received your Bingo Cards, they will stay in your inventory until you decide to play them. We hope this answers all your questions about free Bingo Cards. Just remember, a green card = a free card!","publicationDate":1600848000,"likes":{"amount":2449,"hasLiked":false}},{"id":329401,"title":"LeenD13","headerThumb":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/329401\/thumb\/imagethumb_1600677633.png","shortSummary":"LeenD13 is our VIP of the Week!","headerImage":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/329401\/header\/imageheader_1600677633.png","body":"Congratulations <b>LeenD13<\/b> you are our new VIP of the Week! You win 1 extra week of (Super)VIP and 500 Coins for being awesome!<br><br>Want to be our next lucky VIP to receive this special recognition? Make sure to upload your best profile picture and keep your subscription up to date. Who knows you might be the next lucky winner to be shown on our site! Just let an employee know that you would like to be the VIP of the Week.","publicationDate":1600678800,"likes":{"amount":1117,"hasLiked":true}},{"id":268301,"title":"Exclusive Interview!","headerThumb":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/268301\/thumb\/imagethumb_1594215905.png","shortSummary":"Exclusive interview with player: Eric_Renes!","headerImage":"https:\/\/images.gamepoint.tech\/ingamenews\/gpinternational\/268301\/header\/imageheader_1594215905.png","body":"Do you want to know more about your fellow GamePoint players? This is your chance! We’re not only doing exclusive interviews with our employees, but we also want to get to know our players better! This is why we will do these interviews regularly.<br><br>Today we spoke with Eric_Renes<br><br><b>#1 What’s your name and how long have you been playing on GamePoint?<\/b><br><br>My name is Eric and I’ve been playing on SpelPunt\/GamePoint for about 12 years.<br><br><b>#2 What’s your favorite GamePoint game?<\/b><br><br>That used to be Klaverjassen, but now my favorite games are GamePoint Bingo and GamePoint Casino<br><br><b>#3 What are your hobbies besides GamePoint?<\/b><br><br>Besides playing on GamePoint (which I do on both my laptop and mobile), I like to ride my bicycle and I love to watch shows and movies on Netflix.<br><br><b>#4 If you were a movie character, who’d you be and why?<\/b><br><br>Oh, that’s a hard question. I’ve never thought about that, but I think I’d be Danny Zucko. At the time that Grease was playing in movie theaters, I was a little bit like that. Now, I’ve changed a bit, but I can still see myself in some things that he did.<br><br><b>#5 Can you tell us a fun fact about yourself?<\/b><br><br>I always used to babysit my neighbors’ children. Even now, after I moved, we still keep in touch.<br><br><b>#6 What is your favorite GamePoint event or show?<\/b><br><br>The Live Giveaways on Facebook! I love the interaction between the players and the employees, because you can actually see real people at work!<br><br><b>#7 Can you share your favorite GamePoint memory with us?<\/b><br><br>It’s been a while, when GamePoint was still SpelPunt, but with Sinterklaas I won 1-year VIP!<br><br><b>#8 What message would you like to give to your fellow players?<\/b><br><br>Let’s work together to keep GamePoint fun. It’s just a game and everyone wins and loses sometimes.<br><br><b>#9 Do you have any feedback for GamePoint?<\/b><br><br>No, not really, but maybe to hire more players, who are often online, as hosts, to have more eyes in the chat, because sometimes it’s not fun to read what's being said in the chat.<br><br><b>#10 What player or employee should be interviewed in the future and why?<\/b><br><br>I would like to see Jacky97 get interviewed. I think she’s been playing on GamePoint for a long time as well and I’m very curious to hear about her experiences.<br><br>Would you like a chance to be interviewed by us? Let one of our employees know in the chat or contact support.<br><br>We hope you enjoyed this content and look forward to seeing you at the next interview!","publicationDate":1594713600,"likes":{"amount":3355,"hasLiked":true}}]}
